src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОплаты</name>
      <type>
        <types>EnumRef.СпособОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сдача</name>
      <type>
        <types>EnumRef.Сдача</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗадачаКурьеру/ЗадачаКурьеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачаКурьеру</name>
  <attributes>
    <name>ФИО_клиента1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяДоставки1</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СдачаДляКурьеров1</name>
    <type>
      <types>EnumRef.Сдача</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/МаршрутныйЛист/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДобавитьИзСпискаЗадачНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзСпискаЗадачНаСервере()
	
	//СоздатьТаблицуЗначений(ТЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачаКурьеру.Ссылка КАК Ссылка,
	|	ЗадачаКурьеру.Номер КАК Номер,
	|	ЗадачаКурьеру.Дата КАК Дата,
	|	ЗадачаКурьеру.ФИО_клиента1 КАК ФИО_клиента1,
	|	ЗадачаКурьеру.ИтоговаяСумма1 КАК ИтоговаяСумма,
	|	ЗадачаКурьеру.Телефон1 КАК Телефон,
	|	ЗадачаКурьеру.АдресДоставки1 КАК Адрес,
	|	ЗадачаКурьеру.ДатаИВремяДоставки1 КАК ДатаИВремяДоставки,
	|	ЗадачаКурьеру.СдачаДляКурьеров1 КАК Сдача,
	|	ЗадачаКурьеру.Доставлено КАК Доставлено,
	|	ЗадачаКурьеру.ВОбработке КАК ВОбработке,
	|	ЗадачаКурьеру.СпособОплаты КАК СпособОплаты
	|ИЗ
	|	Документ.ЗадачаКурьеру КАК ЗадачаКурьеру
	|ГДЕ
	|	ЗадачаКурьеру.Доставлено = ЛОЖЬ
	|	И ЗадачаКурьеру.ВОбработке = ЛОЖЬ
	|	И ЗадачаКурьеру.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Таблица.Добавить();
		Строка.Номер = Выборка.Номер;
		Строка.Дата = Выборка.ДатаИВремяДоставки;
		Строка.Адрес = Выборка.Адрес;
		Строка.Сдача = Выборка.Сдача;
		Строка.Сумма = Выборка.ИтоговаяСумма;
		Строка.Галка = ложь;
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)
	//Ключ = ПолучитьИзВременногоХранилища(ЭтотОбъект.ФормаДокумента.АдресВХранилище);
		ФормаДока = ПолучитьФорму("Документ.МаршрутныйЛист.Форма.ФормаДокумента");
	Для Каждого Строка Из Таблица Цикл
		Если Строка.Галка = Истина тогда
			НоваяСтрока = ФормаДока.Объект.СписокЗадач.Добавить();	
			НоваяСтрока.Время = Строка.Дата;
			НоваяСтрока.Адрес =  Строка.Адрес;
			//НоваяСтрока.Клиент = Задача.ФИО_клиента1;
			НоваяСтрока.Сдача =  Строка.Сдача;
			//НоваяСтрока.СпособОплаты =  Задача.СпособОплаты;
			НоваяСтрока.Сумма = Строка.Сумма;
		КонецЕсли;
	КонецЦикла;
	

	ЭтаФорма.Закрыть();
	ФормаДока.Открыть();
КонецПроцедуры
